## Plan Result (766: Managed_Identity_prod - Managed_Identity)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.MI-Operator-azure-policy-manager[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.MI-Operator-azure-policy-manager[0] will be created
  + resource "azurerm_role_assignment" "MI-Operator-azure-policy-manager" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "386b3bd7-de44-4ab1-b496-69a84d506572"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-prod-mi"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label 766: Managed_Identity_prod - Managed_Identity/add-or-update: POST https://api.github.com/repos/hmcts/aks-cft-deploy/issues/735/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":735,"Program":"tfcmt","SHA1":"","Target":"766: Managed_Identity_prod - Managed_Identity","Vars":{}} -->